
//-----------------------------------------------------------------------------
//
// Catbee_CA.h
//
//-----------------------------------------------------------------------------

#ifndef Catbee_CAH
#define Catbee_CAH

//-----------------------------------------------------------------------------

#include "Catbee_Type.h"
//#include "rsa.h"
//-----------------------------------------------------------------------------
//
// CA证书(Len=512)
//
//-----------------------------------------------------------------------------

typedef struct
{
    U32 nSign;                       // 数字标签
    U32 nE;
	U8  aCreateDate[8];				 // 创建日期 (YYYYMMDD)
	U8  aExpireDate[8];				 // 到期日期 (YYYYMMDD)
													 
	U8  aCardID[8];                              // 卡号
	U8  aSerialID[8];                            // 卡系列号
	U8  aGroupID[8];                             // 卡组号

	U8  nActiveSign;                // 激活标识 0xAA=激活；其它=未激活

	U8  aReserved[79];

    U8  aPublic[128];               // 公钥

    U8  aCertification[128];	    // 证书(前面256字节的证书)
    
    U8  aPrivate[128];	            // 私钥
		
} Catbee_CA;

//-----------------------------------------------------------------------------
//
// RSA 参数
//
//-----------------------------------------------------------------------------
typedef struct
{
	U32 nE;							// 
	U8  aModulus[128];               // 模
	U8  aPrivate[128];	            // 私钥

}RSA_PARA;


typedef struct
{
	U32 nP;							//模数的位数,256bit
	U8 aPrivate[32];
	U8 aPublicQx[32];
	U8 aPublicQy[32];
	U8 aSignatureR[32];				//明文签名信息R
	U8 aSignatureS[32];				//明文签名信息S
}SM2_PARA;


//-----------------------------------------------------------------------------

#endif

